# IMPORTAR LIBRERIAS

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import requests

In [2]:
!ls

DataFrame cleaning.ipynb   main.py
Mt_Everest_Ascent_Data.csv src
README.md

In [3]:
!pwd

/Users/jaimecabanyes/Desktop/IRON_HACK/Trabajos IH/W3

In [4]:
ascensos_everest = pd.read_csv("Mt_Everest_Ascent_Data.csv")

# CONOCER EL DATASET

In [5]:
ascensos_everest.head(1)

,Peak,Name,Yr/Seas,Date,Time,Citizenship,Sex,Age,Oxy,Dth,Host
0,EVER,Tenzing Norgay,1953 Spr,29-May,11:30,India,M,39,Y,.,Nepal

In [6]:
ascensos_everest.columns

Index(['Peak ', 'Name ', 'Yr/Seas ', 'Date ', 'Time ', 'Citizenship ', 'Sex ',
       'Age ', 'Oxy ', 'Dth ', 'Host '],
      dtype='object')

In [7]:
ascensos_everest.shape

(10184, 11)

In [8]:
ascensos_everest.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10184 entries, 0 to 10183
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Peak          10184 non-null  object
 1   Name          10184 non-null  object
 2   Yr/Seas       10184 non-null  object
 3   Date          10184 non-null  object
 4   Time          8541 non-null   object
 5   Citizenship   10184 non-null  object
 6   Sex           10184 non-null  object
 7   Age           10184 non-null  int64
 8   Oxy           10184 non-null  object
 9   Dth           10184 non-null  object
 10  Host          10184 non-null  object
dtypes: int64(1), object(10)
memory usage: 875.3+ KB

In [9]:
ascensos_everest.isna().sum()

Peak               0
Name               0
Yr/Seas            0
Date               0
Time            1643
Citizenship        0
Sex                0
Age                0
Oxy                0
Dth                0
Host               0
dtype: int64

# MANIPULAR EL DATASET

In [10]:
ascensos_everest.columns

Index(['Peak ', 'Name ', 'Yr/Seas ', 'Date ', 'Time ', 'Citizenship ', 'Sex ',
       'Age ', 'Oxy ', 'Dth ', 'Host '],
      dtype='object')

In [11]:
ascensos_everest.columns = [col.strip().replace(" ", "_") for col in ascensos_everest.columns]
#Con el strip, quito los espacios del final/principio y con el replace reemplazo los espacios del centro por barrasbajas.

In [12]:
ascensos_everest.columns

Index(['Peak', 'Name', 'Yr/Seas', 'Date', 'Time', 'Citizenship', 'Sex', 'Age',
       'Oxy', 'Dth', 'Host'],
      dtype='object')

In [13]:
def separación_year(year_season):
    return year_season.split()[0]

In [14]:
ascensos_everest["Year"] = ascensos_everest["Yr/Seas"].apply(separación_year)

In [15]:
def separación_season(year_season):
    return year_season.split()[1]

In [16]:
ascensos_everest["Season"] = ascensos_everest["Yr/Seas"].apply(separación_season)

In [17]:
ascensos_everest.head(1)

,Peak,Name,Yr/Seas,Date,Time,Citizenship,Sex,Age,Oxy,Dth,Host,Year,Season
0,EVER,Tenzing Norgay,1953 Spr,29-May,11:30,India,M,39,Y,.,Nepal,1953,Spr

In [18]:
ascensos_everest.head(1)

,Peak,Name,Yr/Seas,Date,Time,Citizenship,Sex,Age,Oxy,Dth,Host,Year,Season
0,EVER,Tenzing Norgay,1953 Spr,29-May,11:30,India,M,39,Y,.,Nepal,1953,Spr

In [19]:
ascensos_everest.Host.unique()

array(['Nepal', 'China'], dtype=object)

In [20]:
def separación_Date(day_month):
        return day_month.split("-")[1]

In [21]:
ascensos_everest["Month"] = ascensos_everest.Date.apply(separación_Date)

In [22]:
def separación_Date1(day_month):
        return day_month.split("-")[0]

In [23]:
ascensos_everest["Day"] = ascensos_everest.Date.apply(separación_Date1)

In [24]:
ascensos_everest.head(1)

,Peak,Name,Yr/Seas,Date,Time,Citizenship,Sex,Age,Oxy,Dth,Host,Year,Season,Month,Day
0,EVER,Tenzing Norgay,1953 Spr,29-May,11:30,India,M,39,Y,.,Nepal,1953,Spr,May,29

In [25]:
ascensos_everest.Time = ascensos_everest.Time.astype(str)

In [26]:
ascensos_everest.columns

Index(['Peak', 'Name', 'Yr/Seas', 'Date', 'Time', 'Citizenship', 'Sex', 'Age',
       'Oxy', 'Dth', 'Host', 'Year', 'Season', 'Month', 'Day'],
      dtype='object')

In [27]:
ascensos_everest = ascensos_everest[['Peak', 'Name', 'Citizenship', 'Sex', 'Age',
       'Oxy', 'Dth', 'Host', 'Year', 'Season', 'Month', 'Day','Time']]

In [28]:
ascensos_everest.head(1)

,Peak,Name,Citizenship,Sex,Age,Oxy,Dth,Host,Year,Season,Month,Day,Time
0,EVER,Tenzing Norgay,India,M,39,Y,.,Nepal,1953,Spr,May,29,11:30

In [29]:
ascensos_everest.Oxy = ascensos_everest['Oxy'].replace('Y','Yes')

In [30]:
ascensos_everest.Dth = ascensos_everest['Dth'].replace('.','No')

In [31]:
ascensos_everest.Dth = ascensos_everest['Dth'].replace('Y','Yes')

In [32]:
ascensos_everest1 = pd.DataFrame(ascensos_everest)

In [33]:
 Deaths = ascensos_everest1.iloc[:, 6]

In [34]:
Deaths.value_counts()

No     10101
Yes       83
Name: Dth, dtype: int64

In [35]:
ascensos_everest1.sample(2)

,Peak,Name,Citizenship,Sex,Age,Oxy,Dth,Host,Year,Season,Month,Day,Time
2395,EVER,Mahmoud Shoaei,Iran,M,42,Yes,No,Nepal,2005,Spr,May,30,10:25
1426,EVER,"Lhakpa Thundu/Thudu (Tindu) Sherpa (Pangboche,...",Nepal,M,30,Yes,No,China,2001,Spr,May,23,11:30